sql/app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT `articles`.* FROM `articles`

  def show
    @article = Article.find(params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`, `status`, `slug`) VALUES ('New test Article', 'This is a test article for friendly URL', '2022-08-20 13:18:52.406546', '2022-08-20 13:18:52.406546', 'public', NULL)

 def edit
     @article = Article.find(params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1