sql/app/controllers/articles_controller.rb

  def show
    @article = Article.find_by(title: params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`title` = 'Hello Rails' LIMIT 1