sql/app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
INSERT INTO `comments` (`commenter`, `body`, `article_id`, `created_at`, `updated_at`) VALUES ('Jack', 'wow, you\'ve added a new article. awesome!', 2, '2022-08-06 16:14:36.182922', '2022-08-06 16:14:36.182922')